
<details><summary>Show Plan</summary>

``` terraform
terraform
module.get_sdk_status.module.lambda.null_resource.docker_build: Refreshing state... [id=7127448366278446896]
module.sdk_analysis.module.lambda.null_resource.docker_build: Refreshing state... [id=7822715688502580053]
module.get_auth.module.lambda.null_resource.docker_build: Refreshing state... [id=6839291668835771310]
module.sdk_analysis.module.ecs_task.null_resource.docker_build: Refreshing state... [id=6063958049123895600]
module.api.aws_apigatewayv2_route.get_auth: Refreshing state... [id=ys87497]
module.api.aws_apigatewayv2_route.sdk_upload: Refreshing state... [id=ah39i4c]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z00493513SFYX7KIRT3B6]
module.api.aws_apigatewayv2_integration.sdk_upload_integration: Refreshing state... [id=4ltzlvc]
module.api.aws_lambda_permission.sdk_upload_lambda_permission: Refreshing state... [id=AllowSDKUploadAPIInvoke]
module.api.aws_apigatewayv2_integration.get_auth_integration: Refreshing state... [id=epm65gn]
module.api.aws_apigatewayv2_api.lambda_gw: Refreshing state... [id=ccr0ug0bj1]
module.sdk_analysis.module.ecs_task.aws_ecr_repository.ecr: Refreshing state... [id=prod-sdk_analysis]
module.sdk_analysis.module.ecs_task.aws_default_vpc.default_vpc: Refreshing state... [id=vpc-95c232e8]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-prod-server-access-logs]
module.sdk_status_db.aws_dynamodb_table.sdk_analysis_statuses: Refreshing state... [id=prod-sdk-analysis-statuses]
module.sdk_analysis.aws_sqs_queue.sdk_queue_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-queue-deadletter]
module.sdk_analysis.module.ecs_task.aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:245339368379:cluster/prod-sdk_analysis-cluster]
module.api.aws_cognito_user_pool.lambda_gw_pool: Refreshing state... [id=us-east-1_nLTgeGIMQ]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-026fcb64]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-1b3c4b56]
module.jupyter_notebook[0].aws_s3_bucket.jupyter: Refreshing state... [id=jupyter-sdk.curibio.com]
module.sdk_analysis.aws_s3_bucket.analyzed_bucket: Refreshing state... [id=prod-sdk-analyzed]
module.sdk_analysis.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=prod-sdk_upload]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-e0fc5ec1]
module.get_auth.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=prod-get_auth]
module.get_sdk_status.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=prod-get_sdk_status]
module.api.aws_iam_role.iam_for_lambda: Refreshing state... [id=prod-iam-for-lambda]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:245339368379:certificate/6354ca50-99dc-4b91-a815-c1f3ca723df9]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.sdk_analysis.aws_s3_bucket.upload_bucket: Refreshing state... [id=prod-sdk-upload]
module.api.aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/prod-lambda-gw]
module.sdk_analysis.module.ecs_task.null_resource.docker_tag: Refreshing state... [id=5757376107970008283]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_TXT]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z00493513SFYX7KIRT3B6__github-challenge-curibio.www.curibio.com_TXT]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z00493513SFYX7KIRT3B6_www_CNAME]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z00493513SFYX7KIRT3B6_a6a6hxwse7f7keb3h845_CNAME]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_A]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_MX]
module.api.aws_cognito_user_pool_client.lambda_gw_pool_client: Refreshing state... [id=63egas596gqdt2fr4cabj4ujs2]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=prod-sdk_analysis-execution-task-role]
module.sdk_analysis.module.lambda.null_resource.docker_tag: Refreshing state... [id=5197624400819512653]
module.get_auth.module.lambda.null_resource.docker_tag: Refreshing state... [id=5014150205567169606]
module.sdk_analysis.module.ecs_task.null_resource.docker_push: Refreshing state... [id=3336393777223344028]
module.api.aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=prod-iam-for-lambda-20210924181509989400000001]
module.api.aws_apigatewayv2_stage.lambda_gw_stage: Refreshing state... [id=prod-lambda-gw-stage]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio.com"]: Refreshing state... [id=Z00493513SFYX7KIRT3B6__cf8a73a02ed777d265f1e560422d8381.curibio.com._CNAME]
module.api.aws_apigatewayv2_authorizer.lambda_gw_auth: Refreshing state... [id=4r1yo8]
module.sdk_analysis.module.lambda.null_resource.docker_push: Refreshing state... [id=5859569853495923956]
module.get_auth.module.lambda.null_resource.docker_push: Refreshing state... [id=3632371305803003695]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio.com]
module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution: Refreshing state... [id=EQU24OD7P9BYZ]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/prod-sdk-upload-lambda]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/prod-get-auth]
module.sdk_analysis.module.ecs_task.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=prod-sdk_analysis-execution-task-role-20210908162419459500000001]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=prod-get-auth]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-logs]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-get-auth-logs]
module.jupyter_notebook[0].aws_route53_record.jupyter_cname: Refreshing state... [id=Z00493513SFYX7KIRT3B6_jupyter-sdk.curibio.com_CNAME]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-17 15:56:52 +0000 UTC]
module.sdk_analysis.aws_sqs_queue.sdk_upload_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-upload-queue]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-inline]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=prod-sdk-upload-lambda-20210924181559297000000002]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=prod-get-auth]
module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=prod-get-auth-20210924181615886100000004]
module.sdk_analysis.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=prod-sdk-upload]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role: Refreshing state... [id=prod-sdk_analysis-ecs_task_role]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=prod-sdk-upload-lambda-20210924181559497000000003]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio.com]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1OSG2PRSZKP4F]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z00493513SFYX7KIRT3B6_downloads.curibio.com_CNAME]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_apigatewayv2_integration.get_auth_integration will be destroyed
  - resource "aws_apigatewayv2_integration" "get_auth_integration" {
      - api_id                 = "ccr0ug0bj1" -> null
      - connection_type        = "INTERNET" -> null
      - description            = "Get auth integration" -> null
      - id                     = "epm65gn" -> null
      - integration_method     = "POST" -> null
      - integration_type       = "AWS_PROXY" -> null
      - integration_uri        = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:245339368379:function:prod-get-auth/invocations" -> null
      - payload_format_version = "1.0" -> null
      - request_parameters     = {} -> null
      - request_templates      = {} -> null
      - timeout_milliseconds   = 30000 -> null
    }

  # module.api.aws_apigatewayv2_integration.sdk_upload_integration will be destroyed
  - resource "aws_apigatewayv2_integration" "sdk_upload_integration" {
      - api_id                 = "ccr0ug0bj1" -> null
      - connection_type        = "INTERNET" -> null
      - description            = "SDK Upload Integration" -> null
      - id                     = "4ltzlvc" -> null
      - integration_method     = "POST" -> null
      - integration_type       = "AWS_PROXY" -> null
      - integration_uri        = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:245339368379:function:prod-sdk-upload-lambda/invocations" -> null
      - payload_format_version = "1.0" -> null
      - request_parameters     = {} -> null
      - request_templates      = {} -> null
      - timeout_milliseconds   = 30000 -> null
    }

  # module.api.aws_apigatewayv2_route.get_auth will be destroyed
  - resource "aws_apigatewayv2_route" "get_auth" {
      - api_id               = "ccr0ug0bj1" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "NONE" -> null
      - id                   = "ys87497" -> null
      - request_models       = {} -> null
      - route_key            = "POST /get_auth" -> null
      - target               = "integrations/epm65gn" -> null
    }

  # module.api.aws_apigatewayv2_route.sdk_upload will be destroyed
  - resource "aws_apigatewayv2_route" "sdk_upload" {
      - api_id               = "ccr0ug0bj1" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "JWT" -> null
      - authorizer_id        = "4r1yo8" -> null
      - id                   = "ah39i4c" -> null
      - request_models       = {} -> null
      - route_key            = "POST /sdk_upload" -> null
      - target               = "integrations/4ltzlvc" -> null
    }

  # module.api.aws_lambda_permission.sdk_upload_lambda_permission will be destroyed
  - resource "aws_lambda_permission" "sdk_upload_lambda_permission" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "prod-sdk-upload-lambda" -> null
      - id            = "AllowSDKUploadAPIInvoke" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:us-east-1:245339368379:ccr0ug0bj1/*/*/*" -> null
      - statement_id  = "AllowSDKUploadAPIInvoke" -> null
    }

  # module.aurora_database.aws_db_parameter_group.parameter_group will be created
  + resource "aws_db_parameter_group" "parameter_group" {
      + arn         = (known after apply)
      + description = "prod-mantarray-rds-parameter-group"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "prod-mantarray-rds-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
      + tags_all    = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
    }

  # module.aurora_database.aws_default_subnet.default_subnet_a will be created
  + resource "aws_default_subnet" "default_subnet_a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.aurora_database.aws_default_subnet.default_subnet_b will be created
  + resource "aws_default_subnet" "default_subnet_b" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.aurora_database.aws_default_vpc.default_vpc will be created
  + resource "aws_default_vpc" "default_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = (known after apply)
      + cidr_block                       = (known after apply)
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = (known after apply)
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags_all                         = (known after apply)
    }

  # module.aurora_database.aws_rds_cluster_parameter_group.cluster_parameter_group will be created
  + resource "aws_rds_cluster_parameter_group" "cluster_parameter_group" {
      + arn         = (known after apply)
      + description = "prod-mantarray-rds-cluster-parameter-group"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "prod-mantarray-rds-cluster-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
      + tags_all    = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
    }

  # module.jupyter_notebook[0].aws_s3_bucket.jupyter will be updated in-place
  ~ resource "aws_s3_bucket" "jupyter" {
        id                          = "jupyter-sdk.curibio.com"
        tags                        = {}
        # (12 unchanged attributes hidden)


      ~ website {
          ~ routing_rules  = jsonencode(
              ~ [
                  ~ {
                      ~ Redirect = {
                          ~ ReplaceKeyWith   = "v2/gh/curibio/jupyter_sdk/v0.16.2?filepath=intro.ipynb" -> "v2/gh/curibio/jupyter_sdk/v0.17.1?filepath=intro.ipynb"
                            # (2 unchanged elements hidden)
                        }
                    },
                ]
            )
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.aurora_database.module.db.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "For Aurora cluster prod-mantarray-rds"
      + id          = (known after apply)
      + name        = "prod-mantarray-rds"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
      + tags_all    = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
    }

  # module.aurora_database.module.db.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allow_major_version_upgrade     = false
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 7
      + cluster_identifier              = "prod-mantarray-rds"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "prod-mantarray-rds"
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + enabled_cloudwatch_logs_exports = [
          + "audit",
          + "error",
          + "general",
          + "slowquery",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "5.7.mysql_aurora.2.09.2"
      + engine_version_actual           = (known after apply)
      + final_snapshot_identifier       = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "admin"
      + port                            = 3306
      + preferred_backup_window         = "02:00-03:00"
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = true
      + tags                            = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
      + tags_all                        = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
      + vpc_security_group_ids          = (known after apply)

      + timeouts {}
    }

  # module.aurora_database.module.db.aws_rds_cluster_instance.this["one"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "prod-mantarray-rds"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-mysql"
      + engine_version                        = "5.7.mysql_aurora.2.09.2"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "prod-mantarray-rds-one"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
      + tags_all                              = {
          + "Application" = "mantarray-rds"
          + "Environment" = "prod"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.aurora_database.module.db.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "prod-mantarray-rds"
        }
    }

  # module.get_auth.module.lambda.aws_apigatewayv2_integration.lambda_api_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_api_integration" {
      + api_id                                    = "ccr0ug0bj1"
      + connection_type                           = "INTERNET"
      + description                               = "Get auth tokens"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:245339368379:function:prod-get-auth/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.get_auth.module.lambda.aws_apigatewayv2_route.lambda_route will be created
  + resource "aws_apigatewayv2_route" "lambda_route" {
      + api_id             = "ccr0ug0bj1"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /get_auth"
      + target             = (known after apply)
    }

  # module.get_auth.module.lambda.aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "prod-get-auth"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:us-east-1:245339368379:ccr0ug0bj1/*/*/*"
      + statement_id  = "AllowAPIInvoke"
    }

  # module.get_sdk_status.module.lambda.aws_apigatewayv2_integration.lambda_api_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_api_integration" {
      + api_id                                    = "ccr0ug0bj1"
      + connection_type                           = "INTERNET"
      + description                               = "Get upload/analysis status of files"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.get_sdk_status.module.lambda.aws_apigatewayv2_route.lambda_route will be created
  + resource "aws_apigatewayv2_route" "lambda_route" {
      + api_id             = "ccr0ug0bj1"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "4r1yo8"
      + id                 = (known after apply)
      + route_key          = "GET /get_sdk_status"
      + target             = (known after apply)
    }

  # module.get_sdk_status.module.lambda.aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "prod-get-sdk-status"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:us-east-1:245339368379:ccr0ug0bj1/*/*/*"
      + statement_id  = "AllowAPIInvoke"
    }

  # module.get_sdk_status.module.lambda.null_resource.docker_build is tainted, so must be replaced
-/+ resource "null_resource" "docker_build" {
      ~ id       = "7127448366278446896" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.get_sdk_status.module.lambda.null_resource.docker_push will be created
  + resource "null_resource" "docker_push" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "2f7560a05813eb24a88b15286693946e"
        }
    }

  # module.get_sdk_status.module.lambda.null_resource.docker_tag will be created
  + resource "null_resource" "docker_tag" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "2f7560a05813eb24a88b15286693946e"
        }
    }

  # module.sdk_analysis.module.ecs_task.data.aws_ecs_task_definition.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "main"  {
      + family          = (known after apply)
      + id              = (known after apply)
      + network_mode    = (known after apply)
      + revision        = (known after apply)
      + status          = (known after apply)
      + task_definition = "prod-sdk_analysis-ecs-task-definition"
      + task_role_arn   = (known after apply)
    }

  # module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk_analysis_logs will be created
  + resource "aws_cloudwatch_log_group" "sdk_analysis_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "prod-sdk-analysis"
      + retention_in_days = 0
      + tags              = {
          + "Application" = "sdk-analysis"
          + "Environment" = "prod"
        }
      + tags_all          = {
          + "Application" = "sdk-analysis"
          + "Environment" = "prod"
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service will be created
  + resource "aws_ecs_service" "aws-ecs-service" {
      + cluster                            = "arn:aws:ecs:us-east-1:245339368379:cluster/prod-sdk_analysis-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "prod-sdk_analysis-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + subnets          = [
              + "subnet-026fcb64",
              + "subnet-1b3c4b56",
              + "subnet-e0fc5ec1",
            ]
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task will be created
  + resource "aws_ecs_task_definition" "aws-ecs-task" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 256
                  + environment      = [
                      + {
                          + name  = "S3_UPLOAD_BUCKET"
                          + value = "prod-sdk-analyzed"
                        },
                      + {
                          + name  = "SDK_STATUS_TABLE"
                          + value = "prod-sdk-analysis-statuses"
                        },
                      + {
                          + name  = "SQS_URL"
                          + value = "https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-upload-queue"
                        },
                    ]
                  + essential        = true
                  + image            = "245339368379.dkr.ecr.us-east-1.amazonaws.com/prod-sdk_analysis:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "prod-sdk-analysis"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "sdk-analysis-service"
                        }
                    }
                  + memory           = 512
                  + name             = "prod-sdk_analysis"
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::245339368379:role/prod-sdk_analysis-execution-task-role"
      + family                   = "prod-sdk_analysis-ecs-task-definition"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::245339368379:role/prod-sdk_analysis-ecs_task_role"
    }

  # module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_role" {
        id                    = "prod-sdk_analysis-ecs_task_role"
        name                  = "prod-sdk_analysis-ecs_task_role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {
          + name   = "prod-sdk_analysis-ecs_inline_policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "sqs:ReceiveMessage",
                              + "sqs:DeleteMessage",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:sqs:us-east-1:245339368379:prod-sdk-upload-queue"
                        },
                      + {
                          + Action   = [
                              + "s3:GetObject",
                              + "s3:PutObject",
                              + "s3:ListBucket",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::prod-sdk-upload",
                              + "arn:aws:s3:::prod-sdk-upload/*",
                              + "arn:aws:s3:::prod-sdk-analyzed",
                              + "arn:aws:s3:::prod-sdk-analyzed/*",
                            ]
                        },
                      + {
                          + Action   = [
                              + "dynamodb:UpdateItem",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:dynamodb:us-east-1:245339368379:table/prod-sdk-analysis-statuses"
                        },
                      + {
                          + Action   = [
                              + "secretsmanager:GetSecretValue",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:secretsmanager:us-east-1:245339368379:secret:db-creds-hdEvmn"
                        },
                      + {
                          + Action   = [
                              + "kms:*",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:kms:us-east-1:245339368379:key/8bab919b-343a-40a5-862e-d0febffcc3ab"
                        },
                      + {
                          + Action   = [
                              + "rds:DescribeDBClusterEndpoints",
                              + "rds:DescribeDBInstances",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:rds:us-east-1:077346344852:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      - inline_policy {
          - name   = "prod-sdk_analysis-ecs_inline_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "sqs:ReceiveMessage",
                              - "sqs:DeleteMessage",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sqs:us-east-1:245339368379:prod-sdk-upload-queue"
                        },
                      - {
                          - Action   = [
                              - "s3:GetObject",
                              - "s3:PutObject",
                              - "s3:ListBucket",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::prod-sdk-upload",
                              - "arn:aws:s3:::prod-sdk-upload/*",
                              - "arn:aws:s3:::prod-sdk-analyzed",
                              - "arn:aws:s3:::prod-sdk-analyzed/*",
                            ]
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:us-east-1:245339368379:table/prod-sdk-analysis-statuses"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_build must be replaced
-/+ resource "null_resource" "docker_build" {
      ~ id       = "6063958049123895600" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "6fb44a44bc4b79cab9915ec613c87a5c" -> "6508a69dc9fa6b1097305a243ec4f452"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_push must be replaced
-/+ resource "null_resource" "docker_push" {
      ~ id       = "3336393777223344028" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "6fb44a44bc4b79cab9915ec613c87a5c" -> "6508a69dc9fa6b1097305a243ec4f452"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_tag must be replaced
-/+ resource "null_resource" "docker_tag" {
      ~ id       = "5757376107970008283" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "6fb44a44bc4b79cab9915ec613c87a5c" -> "6508a69dc9fa6b1097305a243ec4f452"
        }
    }

  # module.sdk_analysis.module.lambda.aws_apigatewayv2_integration.lambda_api_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_api_integration" {
      + api_id                                    = "ccr0ug0bj1"
      + connection_type                           = "INTERNET"
      + description                               = "Handle sdk data upload"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:245339368379:function:prod-sdk-upload-lambda/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.sdk_analysis.module.lambda.aws_apigatewayv2_route.lambda_route will be created
  + resource "aws_apigatewayv2_route" "lambda_route" {
      + api_id             = "ccr0ug0bj1"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "4r1yo8"
      + id                 = (known after apply)
      + route_key          = "POST /sdk_upload"
      + target             = (known after apply)
    }

  # module.sdk_analysis.module.lambda.aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "prod-sdk-upload-lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:us-east-1:245339368379:ccr0ug0bj1/*/*/*"
      + statement_id  = "AllowAPIInvoke"
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_build must be replaced
-/+ resource "null_resource" "docker_build" {
      ~ id       = "7822715688502580053" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "46288da4ba422293effad8813c805660" -> "d00abec38d7ac39719bee183eb43674d"
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_push must be replaced
-/+ resource "null_resource" "docker_push" {
      ~ id       = "5859569853495923956" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "46288da4ba422293effad8813c805660" -> "d00abec38d7ac39719bee183eb43674d"
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_tag must be replaced
-/+ resource "null_resource" "docker_tag" {
      ~ id       = "5197624400819512653" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "46288da4ba422293effad8813c805660" -> "d00abec38d7ac39719bee183eb43674d"
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-1:245339368379:table/prod-sdk-analysis-statuses",
            ]
          + sid       = "dynamodbget"
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/prod-get-sdk-status"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "prod-get-sdk-status-inline"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "prod-get-sdk-status-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-get-sdk-status"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-get-sdk-status"
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-get-sdk-status"
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Get upload/analysis status of files"
      + function_name                  = "prod-get-sdk-status"
      + id                             = (known after apply)
      + image_uri                      = "245339368379.dkr.ecr.us-east-1.amazonaws.com/prod-get_sdk_status:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SDK_STATUS_TABLE" = "prod-sdk-analysis-statuses"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline"  {
      ~ id      = "2452394054" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:PutItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-east-1:245339368379:table/prod-sdk-analysis-statuses"
                      - Sid      = "dynamodbput"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prod-sdk-upload/*"
                      - Sid      = "s3put"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "486093473" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:245339368379:log-group:/aws/lambda/prod-sdk-upload-lambda:*:*",
                          - "arn:aws:logs:us-east-1:245339368379:log-group:/aws/lambda/prod-sdk-upload-lambda:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-inline"
        name      = "prod-sdk-upload-lambda-inline"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:PutItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-east-1:245339368379:table/prod-sdk-analysis-statuses"
                      - Sid      = "dynamodbput"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prod-sdk-upload/*"
                      - Sid      = "s3put"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-logs"
        name      = "prod-sdk-upload-lambda-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:245339368379:log-group:/aws/lambda/prod-sdk-upload-lambda:*:*",
                          - "arn:aws:logs:us-east-1:245339368379:log-group:/aws/lambda/prod-sdk-upload-lambda:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "prod-sdk-upload-lambda"
        name                  = "prod-sdk-upload-lambda"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 37 to add, 5 to change, 12 to destroy.

Changes to Outputs:
  + db_cluster_endpoint = (known after apply)
  + db_creds_arn        = "arn:aws:secretsmanager:us-east-1:245339368379:secret:db-creds-hdEvmn"
  + db_name             = "prod-mantarray-rds"
  + jump_ec2_arn        = "arn:aws:secretsmanager:us-east-1:245339368379:secret:db-ec2-key-pair-FRSQ2E"
  + jump_host           = "ec2-user@jump.curibio.com"
  + role_arn            = "arn:aws:iam::245339368379:role/terraform_deploy_role"

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

Pusher: @jperson